In [1]:
import pandas as pd

In [2]:
import numpy as np

In [3]:
pd.set_option('display.max_columns', None)

In [4]:
pd.set_option('display.max_rows', None)

In [5]:
# Reading data

In [7]:
file1 = pd.read_csv('file1.csv')

In [9]:
file1.head()

,CONTROLN,STATE,GENDER,HV1,IC1,IC4,HVP1,IC5,POBC1,POBC2,IC2,IC3,AVGGIFT,TCODE,DOB,DOMAIN,TARGET_D
0,44060,FL,M,AAA896,392,520.0,7,21975,6,16,430.0,466,28.000000,1,1901,C2,100.0
1,96093,IL,M,537.00,365,473.0,0,19387,1,89,415.0,410,5.666667,0,0,T2,7.0
2,43333,FL,F,725.00,301,436.0,3,18837,11,17,340.0,361,4.111111,0,2501,C2,5.0
3,21885,NC,M,AAA1095,401,413.0,7,14014,1,74,407.0,399,27.277778,0,2208,T2,38.0
4,190108,FL,F,995.00,252,348.0,0,17991,5,6,280.0,316,6.000000,28,0,C2,5.0

In [10]:
file2 = pd.read_csv('file2.txt', sep = '\t')

In [11]:
file2.head()

,CONTROLN,STATE,GENDER,HV1,IC1,IC4,HVP1,IC5,POBC1,POBC2,IC2,IC3,AVGGIFT,TCODE,DOB,DOMAIN,TARGET_D
0,190579,CA,M,3200,310,343,83,17224,31,32,311,333,3.106061,1,0,U1,4.0
1,42997,FL,F,1567,392,409,27,18631,4,10,391,434,6.562500,2,1808,C1,7.0
2,132896,OR,F,953,319,455,1,15729,3,45,379,387,15.571429,2,4410,T1,25.0
3,120189,TX,M,492,244,301,3,10818,0,92,260,284,19.375000,0,0,T2,25.0
4,138829,AZ,feamale,847,185,308,0,11582,3,20,238,225,11.500000,28,3601,T2,25.0

In [12]:
file3 = pd.read_excel('file3.xlsx')

In [13]:
file3.head()

,CONTROLN,STATE,GENDER,HV1,IC1,IC4,HVP1,IC5,POBC1,POBC2,IC2,IC3,AVGGIFT,TCODE,DOB,DOMAIN,TARGET_D
0,119966,TX,F,321,225,281,0,9372,3,68,264,243,8.058824,0,3212,T3,11.0
1,152470,CA,F,5725,610,807,97,53158,13,22,763,698,23.727273,0,0,S1,45.0
2,48527,AL,Male,931,407,496,0,17743,0,65,502,439,4.416667,2,0,R3,3.0
3,171528,CA,F,1895,317,471,46,17431,10,62,389,405,6.705882,0,5501,R2,5.0
4,50122,Tennessee,F,715,318,370,2,12416,0,75,340,352,9.250000,2,0,T1,10.0

In [14]:
file4 = pd.read_excel('file4.xlsx')

In [15]:
file4.head()

,CONTROLN,STATE,GENDER,HV1,IC1,IC4,HVP1,IC5,POBC1,POBC2,IC2,IC3,AVGGIFT,TCODE,DOB,DOMAIN,TARGET_D
0,186307,CA,M,AAA1229,345,438,3,15915,2,58,388,417,16.142857,1,2511,C2,20.0
1,34174,WV,F,529,198,291,0,10816,0,80,218,257,6.083333,2,3001,T2,12.0
2,101388,MO,M,526,340,342,0,9687,0,89,348,321,5.800000,1,5501,R2,10.0
3,159472,CA,F,621,231,279,0,6184,43,41,237,272,11.666667,1,1512,R3,15.0
4,179143,WA,male,1688,496,564,35,22963,2,63,520,521,23.900000,1,3709,T1,25.0

In [16]:
column_names = file1.columns

In [17]:
# blending data

In [18]:
data = pd.DataFrame(columns=column_names)

In [19]:
data.head()

Empty DataFrame
Columns: [CONTROLN, STATE, GENDER, HV1, IC1, IC4, HVP1, IC5, POBC1, POBC2, IC2, IC3, AVGGIFT, TCODE, DOB, DOMAIN, TARGET_D]
Index: []

In [20]:
data = pd.concat([data,file1], axis=0)

In [21]:
data.head()

,CONTROLN,STATE,GENDER,HV1,IC1,IC4,HVP1,IC5,POBC1,POBC2,IC2,IC3,AVGGIFT,TCODE,DOB,DOMAIN,TARGET_D
0,44060,FL,M,AAA896,392,520.0,7,21975,6,16,430.0,466,28.000000,1,1901,C2,100.0
1,96093,IL,M,537.00,365,473.0,0,19387,1,89,415.0,410,5.666667,0,0,T2,7.0
2,43333,FL,F,725.00,301,436.0,3,18837,11,17,340.0,361,4.111111,0,2501,C2,5.0
3,21885,NC,M,AAA1095,401,413.0,7,14014,1,74,407.0,399,27.277778,0,2208,T2,38.0
4,190108,FL,F,995.00,252,348.0,0,17991,5,6,280.0,316,6.000000,28,0,C2,5.0

In [22]:
data = pd.concat([data,file2,file3, file4], axis=0)

In [23]:
data.shape

(4028, 17)

In [24]:
# Standardizing header names

Some standards are:
    use lower case
    if headers have spaces, replace them with underscores

In [25]:
cols = []
for i in range(len(data.columns)):
    cols.append(data.columns[i].lower())

In [26]:
data.columns = cols

In [27]:
data.head()

,controln,state,gender,hv1,ic1,ic4,hvp1,ic5,pobc1,pobc2,ic2,ic3,avggift,tcode,dob,domain,target_d
0,44060,FL,M,AAA896,392,520.0,7,21975,6,16,430.0,466,28.000000,1,1901,C2,100.0
1,96093,IL,M,537.00,365,473.0,0,19387,1,89,415.0,410,5.666667,0,0,T2,7.0
2,43333,FL,F,725.00,301,436.0,3,18837,11,17,340.0,361,4.111111,0,2501,C2,5.0
3,21885,NC,M,AAA1095,401,413.0,7,14014,1,74,407.0,399,27.277778,0,2208,T2,38.0
4,190108,FL,F,995.00,252,348.0,0,17991,5,6,280.0,316,6.000000,28,0,C2,5.0

In [28]:
# deleting columns

In [29]:
data = data.drop(['tcode', 'domain', 'dob'], axis =1)

In [30]:
data.head()

,controln,state,gender,hv1,ic1,ic4,hvp1,ic5,pobc1,pobc2,ic2,ic3,avggift,target_d
0,44060,FL,M,AAA896,392,520.0,7,21975,6,16,430.0,466,28.000000,100.0
1,96093,IL,M,537.00,365,473.0,0,19387,1,89,415.0,410,5.666667,7.0
2,43333,FL,F,725.00,301,436.0,3,18837,11,17,340.0,361,4.111111,5.0
3,21885,NC,M,AAA1095,401,413.0,7,14014,1,74,407.0,399,27.277778,38.0
4,190108,FL,F,995.00,252,348.0,0,17991,5,6,280.0,316,6.000000,5.0

In [31]:
data = data.rename(columns={ 'controln':'id','hv1':'median_home_val', 'ic1':'median_household_income'})

In [32]:
data.head()

,id,state,gender,median_home_val,median_household_income,ic4,hvp1,ic5,pobc1,pobc2,ic2,ic3,avggift,target_d
0,44060,FL,M,AAA896,392,520.0,7,21975,6,16,430.0,466,28.000000,100.0
1,96093,IL,M,537.00,365,473.0,0,19387,1,89,415.0,410,5.666667,7.0
2,43333,FL,F,725.00,301,436.0,3,18837,11,17,340.0,361,4.111111,5.0
3,21885,NC,M,AAA1095,401,413.0,7,14014,1,74,407.0,399,27.277778,38.0
4,190108,FL,F,995.00,252,348.0,0,17991,5,6,280.0,316,6.000000,5.0

In [33]:
# Rearranging columns

In [34]:
data = data[['id', 'state', 'gender', 'median_home_val', 'median_household_income', 'ic2', 'ic3', 'ic4', 'ic5', 'avggift', 'target_d']]

In [35]:
data.head()

,id,state,gender,median_home_val,median_household_income,ic2,ic3,ic4,ic5,avggift,target_d
0,44060,FL,M,AAA896,392,430.0,466,520.0,21975,28.000000,100.0
1,96093,IL,M,537.00,365,415.0,410,473.0,19387,5.666667,7.0
2,43333,FL,F,725.00,301,340.0,361,436.0,18837,4.111111,5.0
3,21885,NC,M,AAA1095,401,407.0,399,413.0,14014,27.277778,38.0
4,190108,FL,F,995.00,252,280.0,316,348.0,17991,6.000000,5.0

In [36]:
# filtering and subsetting -- using conditions with dataframes

In [37]:
# lets say we ar analyzing data of male donors here

In [38]:
# data[data['gender']=='M']

In [39]:
# data[data['gender'].isin(['M', 'F'])]

In [40]:
# data[(data['gender']=='M') | (data['gender']=='F')]

In [41]:
# data[(data['gender']=='M') & (data['state']=='FL')]

In [42]:
# data[data['target_d']>100]

In [43]:
# data[(data['target_d']<100) & (data['gender']=='F')]

# Lesson 2

In [44]:
# working with indexes

In [45]:
filtered = data[data['gender']=='M']
filtered.head()

,id,state,gender,median_home_val,median_household_income,ic2,ic3,ic4,ic5,avggift,target_d
0,44060,FL,M,AAA896,392,430.0,466,520.0,21975,28.000000,100.0
1,96093,IL,M,537.00,365,415.0,410,473.0,19387,5.666667,7.0
3,21885,NC,M,AAA1095,401,407.0,399,413.0,14014,27.277778,38.0
5,100640,IL,M,764.00,457,477.0,480,501.0,16022,25.571429,30.0
7,119038,TX,M,890.00,519,525.0,551,560.0,17872,6.175000,7.0

In [46]:
filtered = filtered.reset_index(drop=True)
filtered.head()

,id,state,gender,median_home_val,median_household_income,ic2,ic3,ic4,ic5,avggift,target_d
0,44060,FL,M,AAA896,392,430.0,466,520.0,21975,28.000000,100.0
1,96093,IL,M,537.00,365,415.0,410,473.0,19387,5.666667,7.0
2,21885,NC,M,AAA1095,401,407.0,399,413.0,14014,27.277778,38.0
3,100640,IL,M,764.00,457,477.0,480,501.0,16022,25.571429,30.0
4,119038,TX,M,890.00,519,525.0,551,560.0,17872,6.175000,7.0

In [47]:
# temp = filtered.copy()
# temp.set_index('state') # This is a dummy case but indexes should be unique and not nulls

In [48]:
filtered[1:4]

,id,state,gender,median_home_val,median_household_income,ic2,ic3,ic4,ic5,avggift,target_d
1,96093,IL,M,537.00,365,415.0,410,473.0,19387,5.666667,7.0
2,21885,NC,M,AAA1095,401,407.0,399,413.0,14014,27.277778,38.0
3,100640,IL,M,764.00,457,477.0,480,501.0,16022,25.571429,30.0

In [49]:
filtered[['gender', 'ic2', 'ic3']][0:10]

  gender    ic2  ic3
0      M  430.0  466
1      M  415.0  410
2      M  407.0  399
3      M  477.0  480
4      M  525.0  551
5      M  458.0  349
6      M  588.0  650
7      M  260.0  312
8      M  168.0  180
9      M  317.0  342

In [50]:
filtered.loc[1:3]

,id,state,gender,median_home_val,median_household_income,ic2,ic3,ic4,ic5,avggift,target_d
1,96093,IL,M,537.00,365,415.0,410,473.0,19387,5.666667,7.0
2,21885,NC,M,AAA1095,401,407.0,399,413.0,14014,27.277778,38.0
3,100640,IL,M,764.00,457,477.0,480,501.0,16022,25.571429,30.0

In [51]:
filtered.loc[100]

id                         124379
state                          TX
gender                          M
median_home_val               308
median_household_income       161
ic2                           186
ic3                           204
ic4                           219
ic5                          6576
avggift                       4.5
target_d                        5
Name: 100, dtype: object

In [52]:
filtered.iloc[1:3] # now i am working just on the indexes row,columns

,id,state,gender,median_home_val,median_household_income,ic2,ic3,ic4,ic5,avggift,target_d
1,96093,IL,M,537.00,365,415.0,410,473.0,19387,5.666667,7.0
2,21885,NC,M,AAA1095,401,407.0,399,413.0,14014,27.277778,38.0

In [57]:
filtered.iloc[1:10,0:4]

       id state gender median_home_val
1   96093    IL      M          537.00
2   21885    NC      M         AAA1095
3  100640    IL      M          764.00
4  119038    TX      M          890.00
5   87259    MT      M             717
6  115823    TX      M            1011
7   95701    IL      M            1063
8    5172    IL      M             291
9  152486    CA      M            1538

In [59]:
filtered.dtypes

id                          object
state                       object
gender                      object
median_home_val             object
median_household_income     object
ic2                        float64
ic3                         object
ic4                        float64
ic5                         object
avggift                    float64
target_d                   float64
dtype: object

In [58]:
filtered[1:3]

,id,state,gender,median_home_val,median_household_income,ic2,ic3,ic4,ic5,avggift,target_d
1,96093,IL,M,537.00,365,415.0,410,473.0,19387,5.666667,7.0
2,21885,NC,M,AAA1095,401,407.0,399,413.0,14014,27.277778,38.0

In [54]:
filtered.iloc[[1,2,3,4],[0,2,4]]

       id gender median_household_income
1   96093      M                     365
2   21885      M                     401
3  100640      M                     457
4  119038      M                     519

In [ ]:
filtered.iloc[[1,2,3,4],[0,2,4]]

In [55]:
# data types

In [ ]:
data.dtypes

In [ ]:
# data._get_numeric_data()

In [ ]:
# data._get_bool_data()

In [ ]:
# data.select_dtypes('object')

In [ ]:
temp = data.copy() # Creating a copy before we start with data cleaning process

In [ ]:
# temp['median_home_val'] = temp['median_home_val'].astype('float', errors='ignore')
# temp.dtypes

# as you would see astype() does not work well here because some elements in the series are strings

In [ ]:
data['median_home_val'] =  pd.to_numeric(data['median_home_val'], errors='coerce')
data['median_household_income'] =  pd.to_numeric(data['median_household_income'], errors='coerce')
data['ic5'] =  pd.to_numeric(data['ic5'], errors='coerce')
data.dtypes
# It replaces the values that are not floats to NaNs

In [ ]:
# Removing duplicates

In [ ]:
print(data.shape)
data = data.drop_duplicates()
print(data.shape)

In [ ]:
# temp = temp.drop_duplicates(subset=['state','gender', 'ic2', 'ic3'])
# if we want to remove duplicates based on some specific columns

# Next code is for section 1.04

# Lesson 1

Dropping columns with more null values
Replacing / imputing null values
Removing outliers

In [ ]:
# data.isna().sum()
# data.isna().sum()/len(data)
round(data.isna().sum()/len(data),4)*100  # shows the percentage of null values in a column

In [ ]:
# dropping columns with more null values -- analyst decides the threshold value

# note that the threshold values are usually higher percentages, for eg if 70% or more
# values in a column are missing, then its a good idea to drop those columns

In [ ]:
nulls_df = pd.DataFrame(round(data.isna().sum()/len(data),4)*100)
nulls_df = nulls_df.reset_index()
nulls_df.columns = ['header_name', 'percent_nulls']
nulls_df

In [ ]:
columns_drop = nulls_df[nulls_df['percent_nulls']>3]['header_name']  # dummy case with 3 
print(columns_drop.values)

In [ ]:
# data = data.drop(columns_drop, axis=1)
# data = data.drop(['gender'], axis=1)

In [ ]:
# Replacing / imputing null values

In [ ]:
# Numerical columns: Some ways to approach the problem

# Ignore these observations
# Replace with general average
# Replace with similar type of averages
# Build model to predict missing values

In [ ]:
# if you have sufficient data and losing a few rows of data is not too bad, you can filter those
# rows out as well

In [ ]:
data[data['gender'].isna()==True] # checking rows that are null based on a specific column

In [ ]:
data = data[data['ic2'].isna()==False] # Since these nulls are not a lot, we can filter them 
data = data[data['ic4'].isna()==False]
data = data[data['ic5'].isna()==False]

In [ ]:
mean_median_home_value = np.mean(data['median_home_val'])
data['median_home_val'] = data['median_home_val'].fillna(mean_median_home_value)

In [ ]:
data.head()

# Lesson 2

In [ ]:
# Replacing null values for categorical variables 

# General Approaches:
    
# Ignore observation
# Replace by most frequent value
# Replace using an algorithm like KNN using the neighbours.
# Predict the observation using a multiclass predictor.
# Treat missing data as just another category

data['gender'].value_counts()

In [ ]:
len(data[data['gender'].isna()==True])  # number of missing values

In [ ]:
data['gender'] = data['gender'].fillna('F')

In [ ]:
# Removing outliers

In [ ]:
# This is done using a box plot which we will cover later 
# After identifying the upper limit and the lower limit values for a numerical column
# we can use filters to remove those rows from the dataframe

In [ ]:
# Exporting this processed data to a csv

In [ ]:
data.to_csv('merged_clean_ver1.csv')

Creating lambda expressions
Creating map functions on columns in dataframes

In [ ]:
y = lambda x: x+2

In [ ]:
y(2)

In [ ]:
square = lambda x: x*x
square(4)

In [ ]:
addition = lambda x,y : x+y
addition(1,3)

In [ ]:
lst = [1,2,3,4,5,6,7,8,10]
new_list = []
for item in lst:
    new_list.append(square(item))
new_list

In [ ]:
new_list = [square(item) for item in lst] # list comprehension
new_list

In [ ]:
new_list = []
for item in lst:
    if item %2 ==0:
        new_list.append(square(item))
new_list

In [ ]:
new_list = [square(item) for item in lst if item%2==0]
new_list

# Lesson 3

In [ ]:
data.columns = list(map(lambda x: x.lower(), data.columns))

In [ ]:
data.dtypes

In [ ]:
# data['gender'] = list(map(lambda x: x.upper(), data['gender'])) 
# This will give you an error. So you have to remove rows where gender is empty

In [ ]:
data['gender'].unique() # check the unique values in the column

In [ ]:
data['gender'] = list(map(lambda x: x.upper(), data['gender']))

In [ ]:
# Cleaning column gender using map function and another user defined function

In [ ]:
def clean(x):
    if x in ['M', 'MALE']:
        return 'Male'
    elif x.startswith('F'):
        return 'Female'
    else:
        return 'U'

In [ ]:
data['gender'] = list(map(clean, data['gender']))

In [ ]:
data['gender'].unique()

In [ ]:
# Creating buckets / groups of data

In [ ]:
ic2_labels = ['Low', 'Moderate', 'High', 'Very High']
data['ic2_'] = pd.cut(data['ic2'],4, labels=ic2_labels)
# there is also pd.qcut which is based on quantiles. We will discuss it later

In [ ]:
# pd.cut(data['ic2'],4) # to check the bins

In [ ]:
# For cities create a user defined function and use it with map()
# to divide the cities into 5 zones - East, west, north, south, and central

# Lesson 4

Working with datetime format
Standardizing input 
Using string functions

In [ ]:
file = pd.read_csv('/Users/himanshuaggarwal/ironhack-my-content/datasets_for_wrangling/ab_testing_case_study/df_final_web_data_pt_1.csv')
file.dtypes

In [ ]:
file.head(3)

In [ ]:
file['date_time'] = pd.to_datetime(file['date_time'], errors='coerce')

In [ ]:
file.head(3)

In [ ]:
file['date_time'][0].day
file['date_time'][0].month
file['date_time'][0].year
file['date_time'][0].isoweekday()  # Returns 1 for Monday and so on

In [ ]:
file['date_time'][0].time()

In [ ]:
file['date_time'][0].isoweekday()

In [ ]:
file['date_time'][0].isoformat()

In [ ]:
file['date_time'][0].strftime(format='%d-%M-%Y')

In [ ]:
file['date_time'][0].strftime(format="%A %d. %B %Y")

https://docs.python.org/3/library/time.html

Directive and their Meaning

%a Locale’s abbreviated weekday name.
%A Locale’s full weekday name.
%b Locale’s abbreviated month name.
%B Locale’s full month name.
%c Locale’s appropriate date and time representation.
%d Day of the month as a decimal number [01,31].
%H Hour (24-hour clock) as a decimal number [00,23].
%I Hour (12-hour clock) as a decimal number [01,12].
%j Day of the year as a decimal number [001,366].
%m Month as a decimal number [01,12].
%M Minute as a decimal number [00,59].
%p Locale’s equivalent of either AM or PM.
%S Second as a decimal number [00,61].
%U Week number of the year (Sunday as the first day of the week) as a decimal number [00,53]. All days in a new year preceding the first Sunday are considered to be in week 0.
%w Weekday as a decimal number [0(Sunday),6].
%W Week number of the year (Monday as the first day of the week) as a decimal number [00,53]. All days in a new year preceding the first Monday are considered to be in week 0
%x Locale’s appropriate date representation.
%X Locale’s appropriate time representation.
%y Year without century as a decimal number [00,99].
%Y Year with century as a decimal number.
%z Time zone offset indicating a positive or negative time difference from UTC/GMT of the form +HHMM or -HHMM, where H represents decimal hour digits and M represents decimal minute digits [-23:59, +23:59].
%Z Time zone name (no characters if no time zone exists).
%% A literal '%' character.

In [ ]:
import time
from datetime import date
today = date.today()
today

In [ ]:
import time
time.time() # time in seconds

In [ ]:
time.localtime(time.time())

In [ ]:
time.gmtime(time.time())

In [ ]:
# String functions

In [ ]:
# https://docs.python.org/2.5/lib/string-methods.html

In [ ]:
string = " I am learning  data  analysis at Ironhack  . It is  super easy "
string.lower()
string.upper()

In [ ]:
'34'.isdigit() # does not work with decimal numbers

In [ ]:
string.lstrip()
string.rstrip()
string.split()
string.split('.')

In [ ]:
string.replace('  ', ' ')